Nat-thapas/STM32-ILI9341/Src/ili9341.c
#include "ili9341.h"

#include "stm32f7xx_hal.h"

/**
 * @brief Select the ILI9341 display
 * @param ili9341 Pointer to ILI9341 handle structure
 */
static void ILI9341_Select(ILI9341_HandleTypeDef* ili9341) {
    HAL_GPIO_WritePin(ili9341->cs_port, ili9341->cs_pin, GPIO_PIN_RESET);
}

void ILI9341_Deselect(ILI9341_HandleTypeDef* ili9341) {
    HAL_GPIO_WritePin(ili9341->cs_port, ili9341->cs_pin, GPIO_PIN_SET);
}

/**
 * @brief Reset the ILI9341 display
 * @param ili9341 Pointer to ILI9341 handle structure
 */
static void ILI9341_Reset(ILI9341_HandleTypeDef* ili9341) {
    HAL_GPIO_WritePin(ili9341->rst_port, ili9341->rst_pin, GPIO_PIN_RESET);
    HAL_Delay(5);
    HAL_GPIO_WritePin(ili9341->rst_port, ili9341->rst_pin, GPIO_PIN_SET);
}

/**
 * @brief Write a command to the ILI9341 display
 * @param ili9341 Pointer to ILI9341 handle structure
 * @param cmd Command byte to write
 */
static void ILI9341_WriteCommand(ILI9341_HandleTypeDef* ili9341, uint8_t cmd) {
    HAL_GPIO_WritePin(ili9341->dc_port, ili9341->dc_pin, GPIO_PIN_RESET);
    HAL_SPI_Transmit(ili9341->spi_handle, &cmd, sizeof(cmd), HAL_MAX_DELAY);
}

/**
 * @brief Write data to the ILI9341 display
 * @param ili9341 Pointer to ILI9341 handle structure
 * @param buff Pointer to the data buffer
 * @param bufferSize Size of the data buffer
 */
static void ILI9341_WriteData(ILI9341_HandleTypeDef* ili9341, uint8_t* buff, size_t bufferSize) {
    HAL_GPIO_WritePin(ili9341->dc_port, ili9341->dc_pin, GPIO_PIN_SET);

    // split data in small chunks because HAL can't send more then 64K at once
    while (bufferSize > 0) {
        uint16_t chunkSize = bufferSize > 32768 ? 32768 : bufferSize;
        HAL_SPI_Transmit(ili9341->spi_handle, buff, chunkSize, HAL_MAX_DELAY);
        buff += chunkSize;
        bufferSize -= chunkSize;
    }
}

ILI9341_HandleTypeDef ILI9341_Init(
    SPI_HandleTypeDef* spi_handle,
    GPIO_TypeDef* cs_port,
    uint16_t cs_pin,
    GPIO_TypeDef* dc_port,
    uint16_t dc_pin,
    GPIO_TypeDef* rst_port,
    uint16_t rst_pin,
    int_fast8_t rotation,
    int_fast16_t width,
    int_fast16_t height
) {
    width = abs(width);
    height = abs(height);

    ILI9341_HandleTypeDef ili9341_instance = {
        .spi_handle = spi_handle,
        .cs_port = cs_port,
        .cs_pin = cs_pin,
        .dc_port = dc_port,
        .dc_pin = dc_pin,
        .rst_port = rst_port,
        .rst_pin = rst_pin,
        .rotation = rotation,
        .width = width,
        .height = height
    };

    ILI9341_HandleTypeDef* ili9341 = &ili9341_instance;

    ILI9341_Select(ili9341);
    ILI9341_Reset(ili9341);

    // Initialization command list is based on https://github.com/martnak/STM32-ILI9341 which have the following license

    /*
        MIT License

        Copyright (c) 2017 martnak

        Permission is hereby granted, free of charge, to any person obtaining a copy
        of this software and associated documentation files (the "Software"), to deal
        in the Software without restriction, including without limitation the rights
        to use, copy, modify, merge, publish, distribute, sublicense, and/or sell
        copies of the Software, and to permit persons to whom the Software is
        furnished to do so, subject to the following conditions:

        The above copyright notice and this permission notice shall be included in all
        copies or substantial portions of the Software.

        THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR
        IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,
        FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE
        AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER
        LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM,
        OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE
        SOFTWARE.
    */

    // SOFTWARE RESET
    ILI9341_WriteCommand(ili9341, 0x01);
    HAL_Delay(1000);

    // POWER CONTROL A
    ILI9341_WriteCommand(ili9341, 0xCB);
    {
        uint8_t data[] = {0x39, 0x2C, 0x00, 0x34, 0x02};
        ILI9341_WriteData(ili9341, data, sizeof(data));
    }

    // POWER CONTROL B
    ILI9341_WriteCommand(ili9341, 0xCF);
    {
        uint8_t data[] = {0x00, 0xC1, 0x30};
        ILI9341_WriteData(ili9341, data, sizeof(data));
    }

    // DRIVER TIMING CONTROL A
    ILI9341_WriteCommand(ili9341, 0xE8);
    {
        uint8_t data[] = {0x85, 0x00, 0x78};
        ILI9341_WriteData(ili9341, data, sizeof(data));
    }

    // DRIVER TIMING CONTROL B
    ILI9341_WriteCommand(ili9341, 0xEA);
    {
        uint8_t data[] = {0x00, 0x00};
        ILI9341_WriteData(ili9341, data, sizeof(data));
    }

    // POWER ON SEQUENCE CONTROL
    ILI9341_WriteCommand(ili9341, 0xED);
    {
        uint8_t data[] = {0x64, 0x03, 0x12, 0x81};
        ILI9341_WriteData(ili9341, data, sizeof(data));
    }

    // PUMP RATIO CONTROL
    ILI9341_WriteCommand(ili9341, 0xF7);
    {
        uint8_t data[] = {0x20};
        ILI9341_WriteData(ili9341, data, sizeof(data));
    }

    // POWER CONTROL,VRH[5:0]
    ILI9341_WriteCommand(ili9341, 0xC0);
    {
        uint8_t data[] = {0x23};
        ILI9341_WriteData(ili9341, data, sizeof(data));
    }

    // POWER CONTROL,SAP[2:0];BT[3:0]
    ILI9341_WriteCommand(ili9341, 0xC1);
    {
        uint8_t data[] = {0x10};
        ILI9341_WriteData(ili9341, data, sizeof(data));
    }

    // VCM CONTROL
    ILI9341_WriteCommand(ili9341, 0xC5);
    {
        uint8_t data[] = {0x3E, 0x28};
        ILI9341_WriteData(ili9341, data, sizeof(data));
    }

    // VCM CONTROL 2
    ILI9341_WriteCommand(ili9341, 0xC7);
    {
        uint8_t data[] = {0x86};
        ILI9341_WriteData(ili9341, data, sizeof(data));
    }

    // MEMORY ACCESS CONTROL
    ILI9341_WriteCommand(ili9341, 0x36);
    {
        uint8_t data[] = {0x48};
        ILI9341_WriteData(ili9341, data, sizeof(data));
    }

    // PIXEL FORMAT
    ILI9341_WriteCommand(ili9341, 0x3A);
    {
        uint8_t data[] = {0x55};
        ILI9341_WriteData(ili9341, data, sizeof(data));
    }

    // FRAME RATIO CONTROL, STANDARD RGB COLOR
    ILI9341_WriteCommand(ili9341, 0xB1);
    {
        uint8_t data[] = {0x00, 0x18};
        ILI9341_WriteData(ili9341, data, sizeof(data));
    }

