Nat-thapas/STM32-ILI9341/Src/ili9341.c
    if (x >= ili9341->width || y >= ili9341->height || w == 0 || h == 0) return;

    if (x < 0) {
        w += x;
        x = 0;
        if (w <= 0) return;
    }

    if (y < 0) {
        h += y;
        y = 0;
        if (h <= 0) return;
    }

    if ((x + w - 1) >= ili9341->width) w = ili9341->width - x;
    if ((y + h - 1) >= ili9341->height) h = ili9341->height - y;

    uint8_t buffer[ILI9341_FILL_RECT_BUFFER_SIZE * 2];
    size_t totalSize = w * h;
    size_t chunkSize = totalSize > ILI9341_FILL_RECT_BUFFER_SIZE ? ILI9341_FILL_RECT_BUFFER_SIZE : totalSize;

    color = (color >> 8) | (color << 8);
    for (size_t i = 0; i < chunkSize; i++) { *(uint16_t*)&buffer[i * 2] = color; }

    ILI9341_SetAddressWindow(ili9341, x, y, x + w - 1, y + h - 1);

    while (totalSize > 0) {
        ILI9341_WriteData(ili9341, buffer, chunkSize * 2);
        totalSize -= chunkSize;
        chunkSize = (totalSize > ILI9341_FILL_RECT_BUFFER_SIZE) ? ILI9341_FILL_RECT_BUFFER_SIZE : totalSize;
    }
}

void ILI9341_FillRectangle(
    ILI9341_HandleTypeDef* ili9341,
    int_fast16_t x,
    int_fast16_t y,
    int_fast16_t w,
    int_fast16_t h,
    uint16_t color
) {
    ILI9341_Select(ili9341);
    ILI9341_FillRectangleFast(ili9341, x, y, w, h, color);
    ILI9341_Deselect(ili9341);
}

void ILI9341_FillScreen(ILI9341_HandleTypeDef* ili9341, uint16_t color) {
    ILI9341_Select(ili9341);
    ILI9341_FillRectangleFast(ili9341, 0, 0, ili9341->width, ili9341->height, color);
    ILI9341_Deselect(ili9341);
}

/**
 * @brief Write a character at specified coordinates without selecting/deselecting the display
 * @param ili9341 Pointer to ILI9341 handle structure
 * @param x X coordinate of the left of the character
 * @param y Y coordinate of the baseline of the character
 * @param ch ASCII character to write
 * @param font Font definition to use for rendering the character
 * @param color 16-bit character color in RGB565 format
 * @param bgColor 16-bit background color in RGB565 format
 */
static void ILI9341_WriteChar(
    ILI9341_HandleTypeDef* ili9341,
    int_fast16_t x,
    int_fast16_t y,
    ILI9341_GlyphDef glyph,
    uint16_t color,
    uint16_t bgColor
) {
    int_fast16_t startX = x + glyph.bbX;
    int_fast16_t startY = y - glyph.bbY - glyph.bbH + 1;
    int_fast16_t endX = startX + glyph.bbW - 1;
    int_fast16_t endY = startY + glyph.bbH - 1;

    if (endX < 0 || endY < 0 || startX >= ili9341->width || startY >= ili9341->height) return;

    int_fast16_t clipStartX = startX < 0 ? -startX : 0;
    int_fast16_t clipStartY = startY < 0 ? -startY : 0;
    int_fast16_t clipEndX = endX >= ili9341->width ? ili9341->width - startX - 1 : glyph.bbW - 1;
    int_fast16_t clipEndY = endY >= ili9341->height ? ili9341->height - startY - 1 : glyph.bbH - 1;

    color = (color >> 8) | (color << 8);
    bgColor = (bgColor >> 8) | (bgColor << 8);

    uint16_t buffer[ILI9341_WRITE_CHAR_BUFFER_SIZE];
    size_t bufferIndex = 0;

    int_fast16_t index = 0;
    uint8_t mask = 0x80;

    ILI9341_SetAddressWindow(ili9341, startX + clipStartX, startY + clipStartY, startX + clipEndX, startY + clipEndY);

    for (int_fast16_t row = 0; row < glyph.bbH; row++) {
        for (int_fast16_t col = 0; col < glyph.bbW; col++) {
            if (row >= clipStartY && row <= clipEndY && col >= clipStartX && col <= clipEndX) {
                if (glyph.data[index] & mask) {
                    buffer[bufferIndex++] = color;
                } else {
                    buffer[bufferIndex++] = bgColor;
                }

                if (bufferIndex >= ILI9341_WRITE_CHAR_BUFFER_SIZE) {
                    ILI9341_WriteData(ili9341, (uint8_t*)buffer, bufferIndex * 2);
                    bufferIndex = 0;
                }
            }

            mask >>= 1;
            if (mask == 0) {
                index++;
                mask = 0x80;
            }
        }
    }

    if (bufferIndex > 0) ILI9341_WriteData(ili9341, (uint8_t*)buffer, bufferIndex * 2);
}

void ILI9341_WriteString(
    ILI9341_HandleTypeDef* ili9341,
    int_fast16_t x,
    int_fast16_t y,
    const char* str,
    ILI9341_FontDef font,
    uint16_t color,
    uint16_t bgColor,
    int_fast16_t tracking
) {
    ILI9341_Select(ili9341);

    while (*str) {
        char c = *str;
        if (c < font.startCodepoint || c > font.endCodepoint) c = ' ';
        ILI9341_GlyphDef glyph = font.glyphs[c - font.startCodepoint];
        ILI9341_WriteChar(ili9341, x, y, glyph, color, bgColor);
        x += glyph.advance + tracking;
        str++;
    }

    ILI9341_Deselect(ili9341);
}

/**
 * @brief Write a scaled character at specified coordinates without selecting/deselecting the display
 * @param ili9341 Pointer to ILI9341 handle structure
 * @param x X coordinate of the left of the character
 * @param y Y coordinate of the baseline of the character
 * @param ch ASCII character to write
 * @param font Font definition to use for rendering the character
 * @param color 16-bit character color in RGB565 format
 * @param bgColor 16-bit background color in RGB565 format
 * @param scale Scaling factor (integer) to enlarge the character
 */
static void ILI9341_WriteCharScaled(
    ILI9341_HandleTypeDef* ili9341,
    int_fast16_t x,
    int_fast16_t y,
    ILI9341_GlyphDef glyph,
    uint16_t color,
    uint16_t bgColor,
    int_fast16_t scale
) {
    int_fast16_t startX = x + glyph.bbX * scale;
    int_fast16_t startY = y - glyph.bbY * scale - glyph.bbH * scale + 1;
    int_fast16_t endX = startX + glyph.bbW * scale - 1;
    int_fast16_t endY = startY + glyph.bbH * scale - 1;

    if (endX < 0 || endY < 0 || startX >= ili9341->width || startY >= ili9341->height) return;

    int_fast16_t clipStartX = startX < 0 ? -startX : 0;
    int_fast16_t clipStartY = startY < 0 ? -startY : 0;
    int_fast16_t clipEndX = endX >= ili9341->width ? ili9341->width - startX - 1 : glyph.bbW * scale - 1;
    int_fast16_t clipEndY = endY >= ili9341->height ? ili9341->height - startY - 1 : glyph.bbH * scale - 1;

