Nat-thapas/STM32-ILI9341/Src/ili9341.c
    color = (color >> 8) | (color << 8);
    bgColor = (bgColor >> 8) | (bgColor << 8);

    uint16_t buffer[ILI9341_WRITE_CHAR_BUFFER_SIZE];
    size_t bufferIndex = 0;

    int_fast32_t bitIndex = 0;

    ILI9341_SetAddressWindow(ili9341, startX + clipStartX, startY + clipStartY, startX + clipEndX, startY + clipEndY);

    for (int_fast16_t row = 0; row < glyph.bbH; row++) {
        for (int_fast16_t vScale = 0; vScale < scale; vScale++) {
            int_fast16_t pixelRow = row * scale + vScale;
            for (int_fast16_t col = 0; col < glyph.bbW; col++) {
                uint8_t mask = 0x80 >> (bitIndex % 8);
                int_fast16_t index = bitIndex / 8;
                for (int_fast16_t hScale = 0; hScale < scale; hScale++) {
                    int_fast16_t pixelCol = col * scale + hScale;
                    if (pixelRow >= clipStartY && pixelRow <= clipEndY && pixelCol >= clipStartX &&
                        pixelCol <= clipEndX) {
                        if (glyph.data[index] & mask) {
                            buffer[bufferIndex++] = color;
                        } else {
                            buffer[bufferIndex++] = bgColor;
                        }

                        if (bufferIndex >= ILI9341_WRITE_CHAR_BUFFER_SIZE) {
                            ILI9341_WriteData(ili9341, (uint8_t*)buffer, bufferIndex * 2);
                            bufferIndex = 0;
                        }
                    }
                }
                bitIndex++;
            }
            bitIndex -= glyph.bbW;
        }
        bitIndex += glyph.bbW;
    }

    if (bufferIndex > 0) ILI9341_WriteData(ili9341, (uint8_t*)buffer, bufferIndex * 2);
}

void ILI9341_WriteStringScaled(
    ILI9341_HandleTypeDef* ili9341,
    int_fast16_t x,
    int_fast16_t y,
    const char* str,
    ILI9341_FontDef font,
    uint16_t color,
    uint16_t bgColor,
    int_fast16_t scale,
    int_fast16_t tracking
) {
    scale = abs(scale);

    ILI9341_Select(ili9341);

    while (*str) {
        char c = *str;
        if (c < font.startCodepoint || c > font.endCodepoint) c = ' ';
        ILI9341_GlyphDef glyph = font.glyphs[c - font.startCodepoint];
        ILI9341_WriteCharScaled(ili9341, x, y, glyph, color, bgColor, scale);
        x += glyph.advance * scale + tracking;
        str++;
    }

    ILI9341_Deselect(ili9341);
}

/**
 * @brief Write a character with transparent background at specified coordinates without selecting/deselecting the
 * display
 * @param ili9341 Pointer to ILI9341 handle structure
 * @param x X coordinate of the left of the character
 * @param y Y coordinate of the baseline of the character
 * @param ch ASCII character to write
 * @param font Font definition to use for rendering the character
 * @param color 16-bit character color in RGB565 format
 */
static void ILI9341_WriteCharTransparent(
    ILI9341_HandleTypeDef* ili9341,
    int_fast16_t x,
    int_fast16_t y,
    ILI9341_GlyphDef glyph,
    uint16_t color
) {
    int_fast16_t startX = x + glyph.bbX;
    int_fast16_t startY = y - glyph.bbY - glyph.bbH + 1;

    int_fast16_t index = 0;
    uint8_t mask = 0x80;

    for (int_fast16_t row = 0; row < glyph.bbH; row++) {
        for (int_fast16_t col = 0; col < glyph.bbW; col++) {
            if (glyph.data[index] & mask) { ILI9341_DrawPixelFast(ili9341, startX + col, startY + row, color); }
            mask >>= 1;
            if (mask == 0) {
                index++;
                mask = 0x80;
            }
        }
    }
}

void ILI9341_WriteStringTransparent(
    ILI9341_HandleTypeDef* ili9341,
    int_fast16_t x,
    int_fast16_t y,
    const char* str,
    ILI9341_FontDef font,
    uint16_t color,
    int_fast16_t tracking
) {
    ILI9341_Select(ili9341);

    while (*str) {
        char c = *str;
        if (c < font.startCodepoint || c > font.endCodepoint) c = ' ';
        ILI9341_GlyphDef glyph = font.glyphs[c - font.startCodepoint];
        ILI9341_WriteCharTransparent(ili9341, x, y, glyph, color);
        x += glyph.advance + tracking;
        str++;
    }

    ILI9341_Deselect(ili9341);
}

/**
 * @brief Write a scaled character with transparent background at specified coordinates without selecting/deselecting
 * the display
 * @param ili9341 Pointer to ILI9341 handle structure
 * @param x X coordinate of the left of the character
 * @param y Y coordinate of the baseline of the character
 * @param ch ASCII character to write
 * @param font Font definition to use for rendering the character
 * @param color 16-bit character color in RGB565 format
 * @param scale Scaling factor (integer) to enlarge the character
 */
static void ILI9341_WriteCharTransparentScaled(
    ILI9341_HandleTypeDef* ili9341,
    int_fast16_t x,
    int_fast16_t y,
    ILI9341_GlyphDef glyph,
    uint16_t color,
    int_fast16_t scale
) {
    int_fast16_t startX = x + glyph.bbX * scale;
    int_fast16_t startY = y - glyph.bbY * scale - glyph.bbH * scale + 1;

    int_fast16_t index = 0;
    uint8_t mask = 0x80;

    for (int_fast16_t row = 0; row < glyph.bbH; row++) {
        for (int_fast16_t col = 0; col < glyph.bbW; col++) {
            if (glyph.data[index] & mask) {
                ILI9341_FillRectangleFast(ili9341, startX + col * scale, startY + row * scale, scale, scale, color);
            }
            mask >>= 1;
            if (mask == 0) {
                index++;
                mask = 0x80;
            }
        }
    }
}

void ILI9341_WriteStringTransparentScaled(
    ILI9341_HandleTypeDef* ili9341,
    int_fast16_t x,
    int_fast16_t y,
    const char* str,
    ILI9341_FontDef font,
    uint16_t color,
    int_fast16_t scale,
    int_fast16_t tracking
) {
    scale = abs(scale);

    ILI9341_Select(ili9341);

    while (*str) {
        char c = *str;
        if (c < font.startCodepoint || c > font.endCodepoint) c = ' ';
        ILI9341_GlyphDef glyph = font.glyphs[c - font.startCodepoint];
        ILI9341_WriteCharTransparentScaled(ili9341, x, y, glyph, color, scale);
        x += glyph.advance * scale + tracking;
        str++;
    }

    ILI9341_Deselect(ili9341);
}

